### Домашнее задание к занятию "5.1. Введение в виртуализацию. Типы и функции гипервизоров. Обзор рынка вендоров и областей применения."
---
## Задача 1
Опишите кратко, как вы поняли: в чем основное отличие полной (аппаратной) виртуализации, паравиртуализации и виртуализации на основе ОС.

### Ответ

```
Контейнеры (виртуализация на основе ОС) могут использовать все ресурсы хостовй машины ( доступновсе железо ),
так же используют общие динамические библиотеки, общие страницы  памяти на хостовой машине, что может экономить ресурсы.
При этом контейнер и хостовая машина должны быть на одинаковом ядре (в базовом понимании).

При Паравирутализации, госетвая ОС используют только собственные ресурсы выделенные гипервизором.

Другими словами: при паравиртуализации имеется слой Гипервизора (отвечающий за разделение ресурсов)в хостовой машине, о
существляющих взаимодействия гостевой ос и железа
в контейнерной релиазаии, контейнер обращается  без явного слоя гипервизора в ОС, разделение ресурсов осуществляется на уровне ОС.
```
## Задача 2
Выберите один из вариантов использования организации физических серверов, в зависимости от условий использования.

* физические сервера
* паравиртуализация
* виртуализация уровня ОС
* Условия использования:

Высоконагруженная база данных, чувствительная к отказу
Различные Java-приложения
Windows системы для использования Бухгалтерским отделом
Системы, выполняющие высокопроизводительные расчеты на GPU
Опишите, почему вы выбрали к каждому целевому использованию такую организацию.

### Ответ
```
Высоконагруженная база данных, чувствительная к отказу
    Физический сервер 
        требуется более высокая производительность, аппаратное размещение дает более высокий отклик, 
        и сокращает точки отказа в виде гипервизора хостовой машны.
        хотя возможно (и используется) использование полной  аппаратной виртуализации при использовании 
        кластеризации для повышения доступности (такиесервера БД имеются у нас организации)
         
Различные Java-приложения
    Виртуализация уровня ОС (контейнеры)
        Требуется меньше ресурсов, выше скорость масштабирования при необходимости расширения. 
        нет жестких требований к аппаратнымм ресурсам, требет меньше ресурсов на администрирование

Windows системы для использования Бухгалтерским отделом
    Паравиртуализация 
        эффективнее делать бэкаприрование -  клонирование всей вирт. машины, 
        возможность расширени ресурсов на уровне вирт. машины. 
        нет критичных требований к доступу к аппаратной составляющей сервера.
        
Системы, выполняющие высокопроизводительные расчеты на GPU
    Физические сервера 
        как мне кажется, для аппаратнх расчетов требуется максимальный доступ к аппаратным ресурсам,
        который физический сервер даетболее эффективно, и а в 2х других, доступ осуществляется черех хостовую ОС 
```
## Задача 3
Как вы думаете, возможно ли совмещать несколько типов виртуализации на одном сервере? Приведите пример такого совмещения.
### Ответ
```
Да:
    например  развернуть Virtualox/vagrant + docker - в полне уживаются на одной Линукс машине.
```		
